//! Raw FFI bindings to `libQuEST` v3.5.0

#![allow(non_snake_case)]
#![allow(non_camel_case_types)]
#![allow(dead_code)]
#![allow(clippy::upper_case_acronyms)]

#[allow(unused_imports)]
use std::ffi::{
    c_char,
    c_double,
    c_float,
    c_int,
    c_longlong,
    c_ulong,
};

#[cfg(not(feature = "f32"))]
pub type qreal = c_double;

#[cfg(feature = "f32")]
pub type qreal = c_float;

#[repr(C)]
#[derive(Debug, Clone, Copy)]
pub enum phaseGateType {
    SIGMA_Z = 0,
    S_GATE = 1,
    T_GATE = 2,
}

#[repr(C)]
#[derive(Debug, Clone, Copy)]
pub struct QASMLogger {
    /// generated QASM string
    buffer:     *mut c_char,
    /// maximum number of chars before overflow
    bufferSize: c_int,
    /// number of chars currently in buffer
    bufferFill: c_int,
    /// whether gates are being added to buffer
    isLogging:  c_int,
}

#[repr(C)]
#[derive(Debug, Clone, Copy)]
pub struct ComplexArray {
    pub real: *mut qreal,
    pub imag: *mut qreal,
}

#[repr(C)]
#[derive(Debug, Clone, Copy)]
pub enum pauliOpType {
    PAULI_I = 0,
    PAULI_X = 1,
    PAULI_Y = 2,
    PAULI_Z = 3,
}

#[repr(C)]
#[derive(Debug, Clone, Copy)]
pub struct Complex {
    pub real: qreal,
    pub imag: qreal,
}

#[repr(C)]
#[derive(Debug, Clone, Copy)]
pub struct ComplexMatrix2 {
    pub real: [[qreal; 2usize]; 2usize],
    pub imag: [[qreal; 2usize]; 2usize],
}

#[repr(C)]
#[derive(Debug, Clone, Copy)]
pub struct ComplexMatrix4 {
    pub real: [[qreal; 4usize]; 4usize],

    pub fn applyPhaseFunc(
        qureg: Qureg,
        qubits: *const c_int,
        numQubits: c_int,
        encoding: bitEncoding,
        coeffs: *const qreal,
        exponents: *const qreal,
        numTerms: c_int,
    );

    pub fn applyPhaseFuncOverrides(
        qureg: Qureg,
        qubits: *const c_int,
        numQubits: c_int,
        encoding: bitEncoding,
        coeffs: *const qreal,
        exponents: *const qreal,
        numTerms: c_int,
        overrideInds: *const c_longlong,
        overridePhases: *const qreal,
        numOverrides: c_int,
    );

    pub fn applyMultiVarPhaseFunc(
        qureg: Qureg,
        qubits: *const c_int,
        numQubitsPerReg: *const c_int,
        numRegs: c_int,
        encoding: bitEncoding,
        coeffs: *const qreal,
        exponents: *const qreal,
        numTermsPerReg: *const c_int,
    );

    pub fn applyMultiVarPhaseFuncOverrides(
        qureg: Qureg,
        qubits: *const c_int,
        numQubitsPerReg: *const c_int,
        numRegs: c_int,
        encoding: bitEncoding,
        coeffs: *const qreal,
        exponents: *const qreal,
        numTermsPerReg: *const c_int,
        overrideInds: *const c_longlong,
        overridePhases: *const qreal,
        numOverrides: c_int,
    );

    pub fn applyNamedPhaseFunc(
        qureg: Qureg,
        qubits: *const c_int,
        numQubitsPerReg: *const c_int,
        numRegs: c_int,
        encoding: bitEncoding,
        functionNameCode: phaseFunc,
    );

    pub fn applyNamedPhaseFuncOverrides(
        qureg: Qureg,
        qubits: *const c_int,
        numQubitsPerReg: *const c_int,
        numRegs: c_int,
        encoding: bitEncoding,
        functionNameCode: phaseFunc,
        overrideInds: *const c_longlong,
        overridePhases: *const qreal,
        numOverrides: c_int,
    );

    pub fn applyParamNamedPhaseFunc(
        qureg: Qureg,
        qubits: *const c_int,
        numQubitsPerReg: *const c_int,
        numRegs: c_int,
        encoding: bitEncoding,
        functionNameCode: phaseFunc,
        params: *const qreal,
        numParams: c_int,
    );

    pub fn applyParamNamedPhaseFuncOverrides(
        qureg: Qureg,
        qubits: *const c_int,
        numQubitsPerReg: *const c_int,
        numRegs: c_int,
        encoding: bitEncoding,
        functionNameCode: phaseFunc,
        params: *const qreal,
        numParams: c_int,
        overrideInds: *const c_longlong,
        overridePhases: *const qreal,
        numOverrides: c_int,
    );

    pub fn applyFullQFT(qureg: Qureg);

    pub fn applyQFT(
        qureg: Qureg,
        qubits: *const c_int,
        numQubits: c_int,
    );

    pub fn applyProjector(
        qureg: Qureg,
        qubit: c_int,
        outcome: c_int,
    );

}

#[cfg(test)]
mod tests {
    #![allow(deref_nullptr)]

    use super::*;

    #[test]
    fn bindgen_test_layout_QASMLogger() {
        assert_eq!(
            ::std::mem::size_of::<QASMLogger>(),
            24usize,
            concat!("Size of: ", stringify!(QASMLogger))
        );
        assert_eq!(
            ::std::mem::align_of::<QASMLogger>(),
            8usize,
            concat!("Alignment of ", stringify!(QASMLogger))
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!((*(::std::ptr::null::<QASMLogger>())).buffer)
                    as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(QASMLogger),
                "::",
                stringify!(buffer)
            )
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!(
                    (*(::std::ptr::null::<QASMLogger>())).bufferSize
                ) as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(QASMLogger),
                "::",
                stringify!(bufferSize)
            )
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!(
                    (*(::std::ptr::null::<QASMLogger>())).bufferFill
                ) as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(QASMLogger),
                "::",
                stringify!(bufferFill)
            )
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!(
                    (*(::std::ptr::null::<QASMLogger>())).isLogging
                ) as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(QASMLogger),
                "::",
                stringify!(isLogging)
            )
        );
    }

    #[test]
    fn bindgen_test_layout_ComplexArray() {
        assert_eq!(
            ::std::mem::size_of::<ComplexArray>(),
            16usize,
            concat!("Size of: ", stringify!(ComplexArray))
        );
        assert_eq!(
            ::std::mem::align_of::<ComplexArray>(),
            8usize,
            concat!("Alignment of ", stringify!(ComplexArray))
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!((*(::std::ptr::null::<ComplexArray>())).real)
                    as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ComplexArray),
                "::",
                stringify!(real)
            )
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!((*(::std::ptr::null::<ComplexArray>())).imag)
                    as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ComplexArray),
                "::",
                stringify!(imag)
            )
        );
    }

    #[test]
    fn bindgen_test_layout_Complex() {
        assert_eq!(
            ::std::mem::size_of::<Complex>(),
            16usize,
            concat!("Size of: ", stringify!(Complex))
        );
        assert_eq!(
            ::std::mem::align_of::<Complex>(),
            8usize,
            concat!("Alignment of ", stringify!(Complex))
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!((*(::std::ptr::null::<Complex>())).real)
                    as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(Complex),
                "::",
                stringify!(real)
            )
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!((*(::std::ptr::null::<Complex>())).imag)
                    as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(Complex),
                "::",
                stringify!(imag)
            )
        );
    }

    #[test]
    fn bindgen_test_layout_ComplexMatrix2() {
        assert_eq!(
            ::std::mem::size_of::<ComplexMatrix2>(),
            64usize,
            concat!("Size of: ", stringify!(ComplexMatrix2))
        );
        assert_eq!(
            ::std::mem::align_of::<ComplexMatrix2>(),
            8usize,
            concat!("Alignment of ", stringify!(ComplexMatrix2))
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!(
                    (*(::std::ptr::null::<ComplexMatrix2>())).real
                ) as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ComplexMatrix2),
                "::",
                stringify!(real)
            )
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!(
                    (*(::std::ptr::null::<ComplexMatrix2>())).imag
                ) as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(ComplexMatrix2),
                "::",
                stringify!(imag)
            )
        );
    }

    #[test]
    fn bindgen_test_layout_ComplexMatrix4() {
        assert_eq!(
            ::std::mem::size_of::<ComplexMatrix4>(),
            256usize,
            concat!("Size of: ", stringify!(ComplexMatrix4))
        );
        assert_eq!(
            ::std::mem::align_of::<ComplexMatrix4>(),
            8usize,
            concat!("Alignment of ", stringify!(ComplexMatrix4))
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!(
                    (*(::std::ptr::null::<ComplexMatrix4>())).real
                ) as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ComplexMatrix4),
                "::",
                stringify!(real)
            )
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!(
                    (*(::std::ptr::null::<ComplexMatrix4>())).imag
                ) as usize
            },
            128usize,
            concat!(
                "Offset of field: ",
                stringify!(ComplexMatrix4),
                "::",
                stringify!(imag)
            )
        );
    }

    #[test]
    fn bindgen_test_layout_ComplexMatrixN() {
        assert_eq!(
            ::std::mem::size_of::<ComplexMatrixN>(),
            24usize,
            concat!("Size of: ", stringify!(ComplexMatrixN))
        );
        assert_eq!(
            ::std::mem::align_of::<ComplexMatrixN>(),
            8usize,
            concat!("Alignment of ", stringify!(ComplexMatrixN))
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!(
                    (*(::std::ptr::null::<ComplexMatrixN>())).numQubits
                ) as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ComplexMatrixN),
                "::",
                stringify!(numQubits)
            )
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!(
                    (*(::std::ptr::null::<ComplexMatrixN>())).real
                ) as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ComplexMatrixN),
                "::",
                stringify!(real)
            )
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!(
                    (*(::std::ptr::null::<ComplexMatrixN>())).imag
                ) as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ComplexMatrixN),
                "::",
                stringify!(imag)
            )
        );
    }

    #[test]
    fn bindgen_test_layout_Vector() {
        assert_eq!(
            ::std::mem::size_of::<Vector>(),
            24usize,
            concat!("Size of: ", stringify!(Vector))
        );
        assert_eq!(
            ::std::mem::align_of::<Vector>(),
            8usize,
            concat!("Alignment of ", stringify!(Vector))
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!((*(::std::ptr::null::<Vector>())).x) as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(Vector),
                "::",
                stringify!(x)
            )
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!((*(::std::ptr::null::<Vector>())).y) as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(Vector),
                "::",
                stringify!(y)
            )
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!((*(::std::ptr::null::<Vector>())).z) as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(Vector),
                "::",
                stringify!(z)
            )
        );
    }

    #[test]
    fn bindgen_test_layout_PauliHamil() {
        assert_eq!(
            ::std::mem::size_of::<PauliHamil>(),
            24usize,
            concat!("Size of: ", stringify!(PauliHamil))
        );
        assert_eq!(
            ::std::mem::align_of::<PauliHamil>(),
            8usize,
            concat!("Alignment of ", stringify!(PauliHamil))
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!(
                    (*(::std::ptr::null::<PauliHamil>())).pauliCodes
                ) as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(PauliHamil),
                "::",
                stringify!(pauliCodes)
            )
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!(
                    (*(::std::ptr::null::<PauliHamil>())).termCoeffs
                ) as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(PauliHamil),
                "::",
                stringify!(termCoeffs)
            )
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!(
                    (*(::std::ptr::null::<PauliHamil>())).numSumTerms
                ) as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(PauliHamil),
                "::",
                stringify!(numSumTerms)
            )
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!(
                    (*(::std::ptr::null::<PauliHamil>())).numQubits
                ) as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(PauliHamil),
                "::",
                stringify!(numQubits)
            )
        );
    }

    #[allow(clippy::too_many_lines)]
    #[test]
    fn bindgen_test_layout_DiagonalOp() {
        assert_eq!(
            ::std::mem::size_of::<DiagonalOp>(),
            56usize,
            concat!("Size of: ", stringify!(DiagonalOp))
        );
        assert_eq!(
            ::std::mem::align_of::<DiagonalOp>(),
            8usize,
            concat!("Alignment of ", stringify!(DiagonalOp))
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!(
                    (*(::std::ptr::null::<DiagonalOp>())).numQubits
                ) as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(DiagonalOp),
                "::",
                stringify!(numQubits)
            )
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!(
                    (*(::std::ptr::null::<DiagonalOp>())).numElemsPerChunk
                ) as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(DiagonalOp),
                "::",
                stringify!(numElemsPerChunk)
            )
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!(
                    (*(::std::ptr::null::<DiagonalOp>())).numChunks
                ) as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(DiagonalOp),
                "::",
                stringify!(numChunks)
            )
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!(
                    (*(::std::ptr::null::<DiagonalOp>())).chunkId
                ) as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(DiagonalOp),
                "::",
                stringify!(chunkId)
            )
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!((*(::std::ptr::null::<DiagonalOp>())).real)
                    as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(DiagonalOp),
                "::",
                stringify!(real)
            )
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!((*(::std::ptr::null::<DiagonalOp>())).imag)
                    as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(DiagonalOp),
                "::",
                stringify!(imag)
            )
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!(
                    (*(::std::ptr::null::<DiagonalOp>())).deviceOperator
                ) as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(DiagonalOp),
                "::",
                stringify!(deviceOperator)
            )
        );
    }

    #[allow(clippy::too_many_lines)]
    #[test]
    fn bindgen_test_layout_Qureg() {
        assert_eq!(
            ::std::mem::size_of::<Qureg>(),
            112usize,
            concat!("Size of: ", stringify!(Qureg))
        );
        assert_eq!(
            ::std::mem::align_of::<Qureg>(),
            8usize,
            concat!("Alignment of ", stringify!(Qureg))
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!(
                    (*(::std::ptr::null::<Qureg>())).isDensityMatrix
                ) as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(Qureg),
                "::",
                stringify!(isDensityMatrix)
            )
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!(
                    (*(::std::ptr::null::<Qureg>())).numQubitsRepresented
                ) as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(Qureg),
                "::",
                stringify!(numQubitsRepresented)
            )
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!(
                    (*(::std::ptr::null::<Qureg>())).numQubitsInStateVec
                ) as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(Qureg),
                "::",
                stringify!(numQubitsInStateVec)
            )
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!(
                    (*(::std::ptr::null::<Qureg>())).numAmpsPerChunk
                ) as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(Qureg),
                "::",
                stringify!(numAmpsPerChunk)
            )
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!(
                    (*(::std::ptr::null::<Qureg>())).numAmpsTotal
                ) as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(Qureg),
                "::",
                stringify!(numAmpsTotal)
            )
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!((*(::std::ptr::null::<Qureg>())).chunkId)
                    as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(Qureg),
                "::",
                stringify!(chunkId)
            )
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!((*(::std::ptr::null::<Qureg>())).numChunks)
                    as usize
            },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(Qureg),
                "::",
                stringify!(numChunks)
            )
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!((*(::std::ptr::null::<Qureg>())).stateVec)
                    as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(Qureg),
                "::",
                stringify!(stateVec)
            )
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!(
                    (*(::std::ptr::null::<Qureg>())).pairStateVec
                ) as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(Qureg),
                "::",
                stringify!(pairStateVec)
            )
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!(
                    (*(::std::ptr::null::<Qureg>())).deviceStateVec
                ) as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(Qureg),
                "::",
                stringify!(deviceStateVec)
            )
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!(
                    (*(::std::ptr::null::<Qureg>())).firstLevelReduction
                ) as usize
            },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(Qureg),
                "::",
                stringify!(firstLevelReduction)
            )
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!(
                    (*(::std::ptr::null::<Qureg>())).secondLevelReduction
                ) as usize
            },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(Qureg),
                "::",
                stringify!(secondLevelReduction)
            )
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!((*(::std::ptr::null::<Qureg>())).qasmLog)
                    as usize
            },
            104usize,
            concat!(
                "Offset of field: ",
                stringify!(Qureg),
                "::",
                stringify!(qasmLog)
            )
        );
    }

    #[test]
    fn bindgen_test_layout_QuESTEnv() {
        assert_eq!(
            ::std::mem::size_of::<QuESTEnv>(),
            24usize,
            concat!("Size of: ", stringify!(QuESTEnv))
        );
        assert_eq!(
            ::std::mem::align_of::<QuESTEnv>(),
            8usize,
            concat!("Alignment of ", stringify!(QuESTEnv))
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!((*(::std::ptr::null::<QuESTEnv>())).rank)
                    as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(QuESTEnv),
                "::",
                stringify!(rank)
            )
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!((*(::std::ptr::null::<QuESTEnv>())).numRanks)
                    as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(QuESTEnv),
                "::",
                stringify!(numRanks)
            )
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!((*(::std::ptr::null::<QuESTEnv>())).seeds)
                    as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(QuESTEnv),
                "::",
                stringify!(seeds)
            )
        );
        assert_eq!(
            unsafe {
                std::ptr::addr_of!((*(::std::ptr::null::<QuESTEnv>())).numSeeds)
                    as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(QuESTEnv),
                "::",
                stringify!(numSeeds)
            )
        );
    }
}
